# VertexPositionNormalColored Properties

---
The VertexPositionNormalColored type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from Vertex)
| Normal|  The vertex's normal vector.
| Position|  The vertex's position.
Top
#### Reference
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace